#산술 연산

#정수,실수,복소수,불리언 4가지 형태(type)
# 정수는 8진법 16진법 2진법
# 실수는 소수점,지수를 통하여 표현한다
# 복소수는 실수부와 허수부
# 불리언은 참과 거짓

# 산술 연산식
# 곱하기 나누기 지수 몫(//) 나머지

# 분수식 계산

# 분자/분모 
# (주의)곱셈기호 생략하지 않음

# print(17/4+(8*2))

# print((1/4)**3 *(2+9)**2)

# print(3*1**3)
# print(2**2**3)
# print(8*7//(6-2)%5/4+3**2-1) ***??
# print(4%5)

# 산술연산 내장함수
# abs 절대값
# int    정수
# float  실수
# round  반올림
# complex 복소수
# divmod 몫과 나머지
# pow    지수
# conjugate 켤레 복소수

# print(5*((5+1/3)**3+((-5+(-1/3))+9)**3))


# 섭씨 &화씨

# 섭씨 c 0~100
# 화씨 f 32~212

# 광년
# 빛이 1년동안 나아가는 거리

# 1초에 299792458 미터
# 1년은 365일5시간 48분46초
# 1년 광년 거리?

print((((365*245)*60+48)*60+46)*299792458)